КАКерамика_моя_старая_база/src/Reports/КнигаУчетаДоходовПатент/КнигаУчетаДоходовПатент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КнигаУчетаДоходовПатент</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокСформированныхЛистов</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
</mdclass:Report>

КАКерамика_моя_старая_база/src/Documents/ЗаписьКУДиР/ЗаписьКУДиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаписьКУДиР</name>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходовРаздел2</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Строки</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа4</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа5</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа6</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа7</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВозникновенияДоходовРасходов</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ДвижениеПрочихАктивовПассивов</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
        <types>DocumentRef.ПриобретениеУслугПоЛизингу</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПервичныйДокумент</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ПрочиеДоходыРасходы</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.МаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ОтражениеЗарплатыВФинансовомУчете</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</types>
        <types>DocumentRef.ВыбытиеДенежныхДокументов</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
        <types>DocumentRef.НачислениеДивидендов</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
        <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
        <types>DocumentRef.СписаниеЗадолженности</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ОтчетКомиссионераОСписании</types>
        <types>CatalogRef.ДоговорыЛизинга</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.РегламентнаяОперация</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
        <types>DocumentRef.ПрочееОприходованиеТоваров</types>
        <types>DocumentRef.НачисленияКредитовИДепозитов</types>
        <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПорчаТоваров</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасходов</name>
      <type>
        <types>EnumRef.ВидыРасходовУСН</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
        <types>EnumRef.ТипыНалогов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
        <types>EnumRef.ВидыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоходЕНВД</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходЕНВД</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
        <types>DocumentRef.ВозвратТоваровОтКлиента</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
        <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
        <types>DocumentRef.ВводОстатков</types>
        <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
        <types>DocumentRef.МаркировкаТоваровГИСМ</types>
        <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.КорректировкаПриобретения</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
        <types>DocumentRef.ПоступлениеОтПереработчика</types>
        <types>DocumentRef.ПоступлениеПредметовЛизинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоходПатент</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Патент</name>
      <type>
        <types>CatalogRef.Патенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УменьшениеНалога</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПФР</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ФСС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ФОМС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ФСС_НС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Больничные</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобровольноеСтрахование</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Строки2</name>
    <attributes>
      <name>ЭлементРасходов</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВозникновенияРасходов</name>
      <type>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа3_ДатаВводаВЭксплуатацию</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа4_ГосударственнаяРегистрация</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа5_ПервоначальнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа6_ОстаточнаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа7_СрокПолезногоИспользования</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа8_КолКварталовВОтчетномПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа9_КолКварталовВНалПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа10_ДоляРасходовЗаНалПериод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа11_ДоляРасходовЗаКвартал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Графа12_СуммаРасходовЗаОтчетнПериод</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа13_СуммаРасходовЗаКвартал</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа14_РасходыПрошлыхПериодов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа15_ОстатокРасходов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Графа16_ДатаВыбытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УплаченныйТорговыйСбор</name>
    <attributes>
      <name>ДатаНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТорговогоСбора</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Catalogs/Патенты/Патенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Патенты</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПатента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрименениеПатента</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Reports/КнигаУчетаДоходовПатент/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ПараметрыОбработчикаОжиданияАктуализации Экспорт;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройки по-умолчанию
	УстановитьНачальныеНастройки();
	
	Параметры.Свойство("РежимРасшифровки", РежимРасшифровки);
	Если РежимРасшифровки Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораПатентаНаСервере();
	
	БухгалтерскиеОтчеты.ИнициализироватьРежимВыгрузкиБП(ЭтотОбъект);
	УстановитьАктивностьКнопокКоманднойПанели(ЭтотОбъект);

	Результат.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	Результат.АвтоМасштаб			= Истина;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	Если ИспользуютсяСтандартныеНастройки Или РежимРасшифровки Тогда
		Возврат;
	КонецЕсли;
	
	БухгалтерскиеОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки, Истина);
	
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
		Отчет.Организация = Параметры.Организация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		ОрганизацияПоУмолчанию = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		Отчет.Организация = ?(ОрганизацияПоУмолчанию.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо,
			ОрганизацияПоУмолчанию, Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	ОрганизацияПриИзмененииНаСервере();
	
	ПатентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	БухгалтерскиеОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БухгалтерскиеОтчетыКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	Если РежимРасшифровки Тогда
		СформироватьОтчетНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	БухгалтерскиеОтчетыКлиент.ПередЗакрытием(ЭтаФорма, Отказ, ЗавершениеРаботы,
		ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	БухгалтерскиеОтчетыКлиент.ПриЗакрытии(ЭтаФорма, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	БухгалтерскийУчетКлиентПереопределяемый.ОбработкаОповещенияАктуализации(ЭтотОбъект, Отчет.Организация, Отчет.КонецПериода, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	БухгалтерскийУчетКлиентПереопределяемый.СкрытьПанельАктуализацииАвтоматически(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПатентПриИзменении(Элемент)
	
	ПатентПриИзмененииНаСервере();
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораЛистаПриИзменении(Элемент)
	
	ПоказатьВыбранныйЛист();

КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	
	БухгалтерскиеОтчетыКлиент.НачатьРасчетСуммыВыделенныхЯчеек(
		Элементы.Результат,
		ЭтотОбъект,
		"Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	
	РучнаяКорректировка = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультат

&НаКлиенте
Процедура Подключаемый_ПечатнаяФормаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокДействий = Новый СписокЗначений;
		
		Если ТипЗнч(Расшифровка.Регистратор) = Тип("ДокументСсылка.ЗаписьКУДиР") Тогда
			СписокДействий.Добавить("СторноОткрыть", НСтр("ru = 'Редактировать запись КУДиР'"));
		Иначе
			СписокДействий.Добавить("Сторно", НСтр("ru = 'Сторнировать текущую запись'"));
		КонецЕсли;
		
		СписокДействий.Добавить("ОткрытьДокументВозникновенияДоходовРасходов", НСтр("ru = 'Открыть документ возникновения доходов'"));
		
		Если ТипЗнч(Расшифровка.Регистратор) <> Тип("ДокументСсылка.ЗаписьКУДиР")
			И Расшифровка.Регистратор <> Расшифровка.ДокументВозникновенияДоходовРасходов Тогда
			СписокДействий.Добавить("ОткрытьДокумент", НСтр("ru = 'Открыть документ сторно дохода'"));
		КонецЕсли;
		
		ОповещениеОВыбореДействия = Новый ОписаниеОповещения("ВыборДействияРасшифровкиЗавершение", ЭтотОбъект, Расшифровка);
		ПоказатьВыборИзМеню(ОповещениеОВыбореДействия, СписокДействий, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если Элементы.Результат.ОтображениеСостояния.Видимость Тогда
		
		ТекущийЭлемент = Элементы.Сформировать;
		ПоказатьПредупреждение( , НСтр("ru = 'Нажмите ""Сформировать"" для получения отчета'"),
								, НСтр("ru = 'Отчет не сформирован'"));
		Возврат;
		
	КонецЕсли;
	
	ПараметрыОтчета = ЗаполнитьПараметрыОтчетаНаСервере();
	
	ПараметрыОтчета.Вставить("РучнаяКорректировка", РучнаяКорректировка);
	ПараметрыОтчета.Вставить("РучнаяНастройка", Ложь); // нет параметров для тонкой настройки
	
	Закрыть(ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	БухгалтерскиеОтчетыКлиент.ОтчетСохранитьКак(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьАктуальность()
	
	БухгалтерскийУчетКлиентПереопределяемый.ПроверитьАктуальность(ЭтотОбъект, Отчет.Организация, Отчет.КонецПериода);

КонецПроцедуры

&НаКлиенте
Процедура Актуализировать(Команда)
	
	БухгалтерскийУчетКлиентПереопределяемый.Актуализировать(ЭтотОбъект, Отчет.Организация, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеАктуализации()
	
	БухгалтерскийУчетКлиентПереопределяемый.ПроверитьВыполнениеАктуализацииОтчета(ЭтотОбъект, Отчет.Организация, Отчет.КонецПериода);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьАктуализацию(Команда)
	
	БухгалтерскийУчетКлиентПереопределяемый.ОтменитьАктуализацию(ЭтотОбъект, Отчет.Организация, Отчет.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстПриНеобходимостиАктуализацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	// Совместимость с БП.
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНажатие(Элемент)
	
	БухгалтерскийУчетКлиентПереопределяемый.СкрытьПанельАктуализации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьЗавершениеАктуализации()
	
	БухгалтерскийУчетКлиентПереопределяемый.ПроверитьЗавершениеАктуализации(ЭтотОбъект, Отчет.Организация, Отчет.КонецПериода);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьПараметрыОтчетаНаСервере()
	
	ПараметрыОтчета = Отчеты.КнигаУчетаДоходовПатент.ПустыеПараметрыКомпоновкиОтчета();
	Отчеты.КнигаУчетаДоходовПатент.ЗаполнитьПараметрыИзФормы(ПараметрыОтчета, ЭтотОбъект);
	
	ВозвращаемыеПараметры = ЗаполнениеФинОтчетностиВБанки.ПодготовитьДвоичныеДанныеПакетаОтображаемыхДокументов(
		ПараметрыОтчета);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВозвращаемыеПараметры, ПараметрыОтчета, Истина);
	
	Возврат ВозвращаемыеПараметры;
	
КонецФункции

&НаКлиенте
Процедура СформироватьОтчетНаКлиенте()
	Перем ОтказПроверкиЗаполнения;
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения", ОтказПроверкиЗаполнения);
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		
	КонецЕсли;
	
	РучнаяКорректировка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальныеНастройки()
	
	Если Не Параметры.Свойство("Организация", Отчет.Организация) Или Не ЗначениеЗаполнено(Отчет.Организация) Тогда
		// Настройки по-умолчанию
		ОрганизацияПоУмолчанию = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		Отчет.Организация = ?(
			ОрганизацияПоУмолчанию.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо,
			ОрганизацияПоУмолчанию,
			Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	
	Если Параметры.Свойство("Патент", Отчет.Патент) И ЗначениеЗаполнено(Отчет.Патент) Тогда
		УстановитьПериодНаСервере();
	ИначеЕсли Параметры.Свойство("НачалоПериода")
	   И ЗначениеЗаполнено(Параметры.НачалоПериода) И ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		Отчет.НачалоПериода = НачалоДня(Параметры.НачалоПериода);
		Отчет.КонецПериода  = КонецДня(Параметры.КонецПериода);
	Иначе
		ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
		Отчет.НачалоПериода = НачалоКвартала(ТекущаяДата);
		Отчет.КонецПериода  = КонецКвартала(ТекущаяДата);
	КонецЕсли;
	
	Параметры.Свойство("Расширение", Расширение);
	Параметры.Свойство("ТипФайла", ТипФайла);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ЗаголовокОтчета = НСтр("ru = 'Книга доходов по патенту'");
	
	Если ЗначениеЗаполнено(Отчет.Патент) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " " + Отчет.Патент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.Организация) И Форма.ИспользуетсяНесколькоОрганизаций Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " "
			+ БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(Отчет.Организация);
	КонецЕсли;
	
	Форма.Заголовок = ЗаголовокОтчета;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	ЗаполнитьСписокВыбораПатентаНаСервере();
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПатентПриИзмененииНаСервере()
	
	УстановитьПериодНаСервере();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПатентаНаСервере()
	
	ВсеПатенты = Справочники.Патенты.ПолучитьПатентыПоОрганизации(Отчет.Организация);
	Элементы.Патент.СписокВыбора.ЗагрузитьЗначения(ВсеПатенты);
	
	Если ЗначениеЗаполнено(Отчет.Патент) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВсеПатенты.Количество() = 1 Тогда
		Отчет.Патент = ВсеПатенты[0];
	Иначе
		Если ВсеПатенты.Найти(Отчет.Патент) = Неопределено Тогда
			Отчет.Патент = Справочники.Патенты.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПериодНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Отчет    = Форма.Отчет;
	Элементы = Форма.Элементы;
	
	Элементы.Патент.Видимость = Не (ЗначениеЗаполнено(Отчет.Патент) И Элементы.Патент.СписокВыбора.Количество() = 1);
	
	ОбновитьТекстЗаголовка(Форма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодНаСервере()

	Если ЗначениеЗаполнено(Отчет.Патент) Тогда
		СвойстваПатента	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отчет.Патент, "ДатаНачала, ДатаОкончания");
		Отчет.НачалоПериода	= НачалоДня(СвойстваПатента.ДатаНачала);
		Отчет.КонецПериода	= КонецДня(СвойстваПатента.ДатаОкончания);
	Иначе
		Отчет.НачалоПериода	= '00010101';
		Отчет.КонецПериода	= '00010101';
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура("Организация, Патент, НачалоПериода, КонецПериода, СписокСформированныхЛистов");
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, Отчет);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	Если ИБФайловая Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Отчеты.КнигаУчетаДоходовПатент.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор, 
			"Отчеты.КнигаУчетаДоходовПатент.СформироватьОтчет", 
			ПараметрыОтчета, 
			БухгалтерскиеОтчетыКлиентСервер.ПолучитьНаименованиеЗаданияВыполненияОтчета(ЭтаФорма));
		
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
		АдресХранилища       = РезультатВыполнения.АдресХранилища;
	КонецЕсли;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	Отчет.СписокСформированныхЛистов = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ИндексСформированногоЛиста = ПолучитьИндексСформированногоЛиста(СписокВыбораЛиста, Отчет.СписокСформированныхЛистов);
	
	Элементы.СписокВыбораЛиста.СписокВыбора.Очистить();
	Если Отчет.СписокСформированныхЛистов.Количество() > 0 Тогда
		
		Для Каждого Лист Из Отчет.СписокСформированныхЛистов Цикл
			Элементы.СписокВыбораЛиста.СписокВыбора.Добавить(Лист.Представление);
		КонецЦикла; 
		
		СписокВыбораЛиста = Отчет.СписокСформированныхЛистов.Получить(
			?(ИндексСформированногоЛиста = Неопределено, 0, ИндексСформированногоЛиста)).Представление;
		
		Если Отчет.СписокСформированныхЛистов.Количество() <= 1 Тогда
			Элементы.СписокВыбораЛиста.Видимость = Ложь;
		Иначе
			Элементы.СписокВыбораЛиста.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
	ПоказатьВыбранныйЛист();
	Элементы.Результат.УстановитьДействие("ОбработкаРасшифровки", "Подключаемый_ПечатнаяФормаОбработкаРасшифровки");
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИндексСформированногоЛиста(ИмяЛиста, СписокСформированныхЛистов)
	
	Если ИмяЛиста = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Для Каждого Лист Из СписокСформированныхЛистов Цикл
		Если Лист.Представление = ИмяЛиста Тогда
			Возврат СписокСформированныхЛистов.Индекс(Лист);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПоказатьВыбранныйЛист()
	
	Результат.Очистить();
	
	ИндексСформированногоЛиста = ПолучитьИндексСформированногоЛиста(СписокВыбораЛиста, Отчет.СписокСформированныхЛистов);
	
	Если ИндексСформированногоЛиста <> Неопределено Тогда
		СформированныйЛист = Отчет.СписокСформированныхЛистов.Получить(ИндексСформированногоЛиста).Значение;
		Результат.Вывести(СформированныйЛист);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
			
			БухгалтерскийУчетКлиентПереопределяемый.ПослеФормированияОтчета(ЭтотОбъект);
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = БухгалтерскиеОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	БухгалтерскиеОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, Элементы.Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииПодключаемый");
	
КонецПроцедуры

#Область ДополнительныеМетоды

// Настраивает кнопки командной панели.
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - на командной панели которой есть кнопка ПредварительныйПросмотр.
//
&НаСервереБезКонтекста
Процедура УстановитьАктивностьКнопокКоманднойПанели(Форма)

	Если Не ПравоДоступа("Вывод", Метаданные) Тогда
		// Делает неактивной кнопку "Сохранить", если пользователю не разрешен вывод.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "Сохранить", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "СохранитьВсеДействия", "Доступность", Ложь);

	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоВебКлиент() Тогда
		// Скрывает кнопку "Предварительный просмотр" при работе через браузер, т.к. она работает также как "Печать".
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ПредварительныйПросмотр", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ПредварительныйПросмотрВсеДействия", "Видимость", Ложь);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборДействияРасшифровкиЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "Сторно" Тогда
		
		ДанныеДляЗаполнения = Новый Структура("Организация", Отчет.Организация);
		МассивСторно = СторноКУДиРПоТекущимЗаписямДокумента(ДополнительныеПараметры);
		Если МассивСторно.Количество() Тогда
			ДанныеДляЗаполнения.Вставить("Дата", МассивСторно.Получить(0).Период);
			ДанныеДляЗаполнения.Вставить("Строки", МассивСторно);
			
			ПараметрыЗаписи = Новый Структура("Основание", ДанныеДляЗаполнения);
			
			ОткрытьФорму("Документ.ЗаписьКУДиР.ФормаОбъекта", ПараметрыЗаписи, ЭтотОбъект);
		КонецЕсли;
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОткрытьДокументВозникновенияДоходовРасходов" Тогда
		
		ПоказатьЗначение(, ДополнительныеПараметры.ДокументВозникновенияДоходовРасходов);
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ОткрытьДокумент" ИЛИ ВыбранныйЭлемент.Значение = "СторноОткрыть"  Тогда
		
		ПоказатьЗначение(, ДополнительныеПараметры.Регистратор);
		
	КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СторноКУДиРПоТекущимЗаписямДокумента(ДополнительныеПараметры)
	ДополнительныеПараметрыСторнирования = Новый Структура;
	Если ДополнительныеПараметры.Свойство("ДокументВозникновенияДоходовРасходов") Тогда
		ДополнительныеПараметрыСторнирования.Вставить("ДокументВозникновенияДоходовРасходов", ДополнительныеПараметры.ДокументВозникновенияДоходовРасходов);
	КонецЕсли;
	Возврат УчетУСНПСНСервер.СторноКУДиРПоТекущимЗаписямДокумента(ДополнительныеПараметры.Регистратор, ДополнительныеПараметрыСторнирования);
КонецФункции

#КонецОбласти

#КонецОбласти
